_posts/2018-06-01-analytic-folds.html
---
layout: post
title: Analytic Differentiation of Folds
excerpt: Analytic of differentiation of left folds in Haskell.
---

<div id="outline-container-org4d5017d" class="outline-2">
<h2 id="org4d5017d">Introduction</h2>
<div class="outline-text-2" id="text-org4d5017d">
<p>
The <code>accelerate</code> library is a high-level interface to GPU programming, implemented as a DSL in Haskell.
Internally, <code>accelerate</code> programs get compiled from a high-level AST to a lower-level one.
While this is convenient from a compiler author's perspective, it is a bit challenging from the perspective of automatic differentiation, since it is no longer possible to implement AD at the operation-by-operation scale as it is in most libraries.
This means that any AD library for <code>accelerate</code> will have to be able to differentiate <a href="https://github.com/AccelerateHS/accelerate/blob/master/src/Data/Array/Accelerate/AST.hs#L386">folds</a>, among other things, as a concept, and not as functions built out of simpler operations.
</p>

<p>
In this blog post, I will use <code>sage</code> to derive an "analytic" formula for the derivative of a fold, which expresses the derivative of a fold in terms of existing functional combinators like <code>map</code>, <code>scan</code>, and <code>zipWith</code>, as well as the chain rule.
</p>
</div>
</div>

<div id="outline-container-org51405ca" class="outline-2">
<h2 id="org51405ca">Computation</h2>
<div class="outline-text-2" id="text-org51405ca">
<p>
Let's get started!
</p>

<p>
First, we'll introduce some symbolic variables and functions.
</p>
<div class="org-src-container">
<pre class="src src-sage">var('u,v,w,x,y,z')
function('f')(u,v)
</pre>
</div>

<p>
Next, we'll compute the Jacobian of a left fold to see if we can find any patterns.
We'll compute the symbolic Jacobian of the following Haskell code.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">foldl1</span> f <span class="org-rainbow-delimiters-depth-1">[</span>u,v,w,x,y,z<span class="org-rainbow-delimiters-depth-1">]</span>
</pre>
</div>
<p>
The symbolic result is a mess, but it does have some structure we can pick apart.
</p>
<div class="org-src-container">
<pre class="src src-sage">jacobian(f(f(f(f(f(u,v),w),x),y),z),(u,v,w,x,y,z)).list()
</pre>
</div>

<pre class="example">
[diff(f(u, v), u)*D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 diff(f(u, v), v)*D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(f(f(u, v), w), x), y), z)]
</pre>


<p>
Looking at the structure of the symbolic Jacobian, a few things stand out.
</p>
<ul class="org-ul">
<li>We can replace the original <code>fold</code> with a <code>scan</code>, since the Jacobian requires all the intermediate steps.</li>
<li>The <code>D[1](f)</code> structure at the beginning of each line has an obvious pattern, which we can capture with a <code>zipWith</code>. The <code>D[0](f)</code> structure that forms the rest of the computation looks like a <code>scan</code> of some sort.</li>
<li>With a little more juggling, we should be able to express the Jacobian in terms of some combinators.</li>
</ul>

<p>
Let's figure out exactly what's going on.
We'll define some Sage versions of the combinators we'll need.
</p>
<div class="org-src-container">
<pre class="src src-sage">def zipWith(f,xs,ys):
    return [f(x,y) for x,y in zip(xs,ys)]

def scanl(f, x0, xs):
    res = [x0]+xs
    for i in range(len(xs)):
        res[i+1] = f(res[i], xs[i])
    return res

def scanl1(f, xs):
    return scanl(f, xs[0], xs[1:])
</pre>
</div>

<p>
Next, let's define some basic terms on which we'll operate.
</p>
<ul class="org-ul">
<li><code>f0</code> and <code>f1</code> are the partial derivatives of <code>f</code></li>
<li><code>lst</code> is the list of variables we are folding over</li>
<li><code>fs</code> is a scan over the input, using our function <code>f</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sage">f0 = diff(f(u,v),u)
f1 = diff(f(u,v),v)
lst = [u,v,w,x,y,z]
fs = scanl1(f, lst)
</pre>
</div>
<p>
We can now take care of the second item on our list of observations.
</p>
<div class="org-src-container">
<pre class="src src-sage">term1 = [1]+zipWith(f1, fs, lst[1:])
term1
</pre>
</div>

<pre class="example">
[1,
 diff(f(u, v), v),
 D[1](f)(f(u, v), w),
 D[1](f)(f(f(u, v), w), x),
 D[1](f)(f(f(f(u, v), w), x), y),
 D[1](f)(f(f(f(f(u, v), w), x), y), z)]
</pre>


<p>
Let's push on ahead and compute the last structural component we noticed.
(Protip: <code>[::-1]</code> is a Python idiom for reversing a list.)
</p>
<div class="org-src-container">
<pre class="src src-sage">term2 = scanl1(lambda x,y:x*y, zipWith(f0, fs, lst[1:])[::-1])[::-1]+[1]
term2
</pre>
</div>

<pre class="example">
[diff(f(u, v), u)*D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[0](f)(f(f(f(f(u, v), w), x), y), z),
 1]
</pre>


<p>
Finally, we can obtain the symbolic Jacobian we computed directly.
</p>
<div class="org-src-container">
<pre class="src src-sage">zipWith(lambda x,y:x*y,term1,term2)
</pre>
</div>

<pre class="example">
[diff(f(u, v), u)*D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 diff(f(u, v), v)*D[0](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(u, v), w)*D[0](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(u, v), w), x)*D[0](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(f(u, v), w), x), y)*D[0](f)(f(f(f(f(u, v), w), x), y), z),
 D[1](f)(f(f(f(f(u, v), w), x), y), z)]
</pre>
</div>
</div>

<div id="outline-container-org47de626" class="outline-2">
<h2 id="org47de626">Conclusion</h2>
<div class="outline-text-2" id="text-org47de626">
<p>
<code>accelerate</code> has a few more primitives that will require similar treatment, including scans and segmented folds, as well as a few more fold variants.
However, I'm optimistic all of these can be tackled with a similar approach.
The results obtained here can be summarized like so.
</p>
<div class="org-src-container">
<pre class="src src-sage">def autodiff_foldl1(f, lst):
    fs = scanl1(f,lst)
    f0 = diff(f(u,v),u)         # first partial (as a function)
    f1 = diff(f(u,v),v)         # second partial (as a function)
    prod = lambda x,y: x*y
    term1 = [1]+zipWith(f1, fs, lst[1:])
    term2 = scanl1(prod, zipWith(f0, fs, lst[1:])[::-1])[::-1]+[1]
    return zipWith(prod, term1, term2)
</pre>
</div>

<p>
The technique even works with the edge case of a two-variable vector.
</p>
<div class="org-src-container">
<pre class="src src-sage">autodiff_foldl1(f, [u,v])
</pre>
</div>

<pre class="example">
[diff(f(u, v), u), diff(f(u, v), v)]
</pre>
</div>
</div>
